# **Pandas**

In [425]:
pip install pandas

Requirement already satisfied: pandas in c:\users\pratiksha\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\pratiksha\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pratiksha\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pratiksha\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pratiksha\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\pratiksha\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [426]:
#importing pandas in diffrent ways
import pandas
import pandas as pd 
from pandas import pandas  as pd

In [427]:
#directories
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [428]:
#version
pd.__version__

'2.2.3'

In [429]:
#documentation
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

### **Series**
can use  a list

In [430]:
age =[20,25,30,41,12,10,15,60]
series =pd.Series(age)
series

0    20
1    25
2    30
3    41
4    12
5    10
6    15
7    60
dtype: int64

In [431]:
age =[20,25,30,41,12,10,15,60]
index= ['a','b','c','d','e','f','g','h']

series =pd.Series(data=age, index=index,name='Series')
series

a    20
b    25
c    30
d    41
e    12
f    10
g    15
h    60
Name: Series, dtype: int64

 ## **DataFrame**
 - 2d with rows and communication
 - hetrogeneous handling

In [432]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ivan', 'Jack', 'Ivan', 'Jack', 'Grace', 'Hannah'],  
    'Age': [45, 58, 60, 28, 49, 67, None, 60, 37, 31, 37, 31, 29, 60],  
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Paris', 'Berlin', 'New York', 'Tokyo', 'London', 'Tokyo', 'London', 'Berlin', 'New York'],  
    'Salary': [95445, 86235, 62330, 46022, 65999, 88320, 57141, 65413, 87016, 58725, 87016, 58725, 57141, None],  
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-09', '2023-01-10', '2023-01-07', '2023-01-08'],  
    'Category': ['A', 'B', 'C', 'A', 'B', 'A', 'C', 'B', 'A', 'B', 'A', 'B', None, 'B']  
}

In [433]:
print(pd.DataFrame.__doc__)

Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3

In [434]:
df=pd.DataFrame(data=data)
df

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3     David  28.0     Paris  46022.0  2023-01-04        A
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
6     Grace   NaN    Berlin  57141.0  2023-01-07        C
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
12    Grace  29.0    Berlin  57141.0  2023-01-07     None
13   Hannah  60.0  New York      NaN  2023-01-08        B

## **Data ingestion**

In [435]:
# df1 = pd.read_csv(r'data.csv')
# df2= pd.read_excel(r'data.xlsx',sheet_name='sheet1')
#df3 = pd.read_json(r'data.json')
#df4 = pd.read_sql(r'sql=)

## **Data Store**

In [436]:
# to store data in csv format
df.to_csv(r'C:/Users/Pratiksha/Downloads/data.csv',index=False) 

# to store data in excel format
df.to_excel(r'C:/Users/Pratiksha/Downloads/data.xlsx',index=False,sheet_name='Data') 

# to store data in json format
df.to_json(r'C:/Users/Pratiksha/Downloads/data.json',index=False,orient='records',indent=4)

In [437]:
#pip install openpyxl for excel file reader

## **Data Extraction**

In [438]:
#default top5 rows
df.head()

      Name   Age      City   Salary        Date Category
0    Alice  45.0  New York  95445.0  2023-01-01        A
1      Bob  58.0    London  86235.0  2023-01-02        B
2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3    David  28.0     Paris  46022.0  2023-01-04        A
4      Eva  49.0    Berlin  65999.0  2023-01-05        B

In [439]:
#negative value inside paranthesis removes last rows from last
df.head(-1)

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3     David  28.0     Paris  46022.0  2023-01-04        A
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
6     Grace   NaN    Berlin  57141.0  2023-01-07        C
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
12    Grace  29.0    Berlin  57141.0  2023-01-07     None

In [440]:
#bottom 5 rows
df.tail()

      Name   Age      City   Salary        Date Category
9     Jack  31.0    London  58725.0  2023-01-10        B
10    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11    Jack  31.0    London  58725.0  2023-01-10        B
12   Grace  29.0    Berlin  57141.0  2023-01-07     None
13  Hannah  60.0  New York      NaN  2023-01-08        B

In [441]:
#show dimensionality of the data
df.shape

(14, 6)

In [442]:
#to get only rows using index 
df.shape[0]

14

In [443]:
#columns
df.shape[1]

6

In [444]:
#size of the database
df.size

84

In [445]:
#datatypes of each column
df.dtypes

Name         object
Age         float64
City         object
Salary      float64
Date         object
Category     object
dtype: object

In [446]:
df.Name.dtype

dtype('O')

In [447]:
df.Name

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Jack
10       Ivan
11       Jack
12      Grace
13     Hannah
Name: Name, dtype: object

In [448]:
df['Name']

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Jack
10       Ivan
11       Jack
12      Grace
13     Hannah
Name: Name, dtype: object

In [449]:
df[['Name']]

       Name
0     Alice
1       Bob
2   Charlie
3     David
4       Eva
5     Frank
6     Grace
7    Hannah
8      Ivan
9      Jack
10     Ivan
11     Jack
12    Grace
13   Hannah

In [450]:
df[['Name','Age']]

       Name   Age
0     Alice  45.0
1       Bob  58.0
2   Charlie  60.0
3     David  28.0
4       Eva  49.0
5     Frank  67.0
6     Grace   NaN
7    Hannah  60.0
8      Ivan  37.0
9      Jack  31.0
10     Ivan  37.0
11     Jack  31.0
12    Grace  29.0
13   Hannah  60.0

In [451]:
#accessing all columns
df.columns

Index(['Name', 'Age', 'City', 'Salary', 'Date', 'Category'], dtype='object')

In [452]:
#accessing specific columns
df.columns[:5]

Index(['Name', 'Age', 'City', 'Salary', 'Date'], dtype='object')

In [453]:
df.columns[3:5]

Index(['Salary', 'Date'], dtype='object')

In [454]:
# entire information about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      14 non-null     object
 1   Age       13 non-null     float64
 2   City      14 non-null     object
 3   Salary    13 non-null     float64
 4   Date      14 non-null     object
 5   Category  13 non-null     object
dtypes: float64(2), object(4)
memory usage: 804.0+ bytes

In [455]:
for col in df.columns: # can be for one column
    print(f"{col} :{ df[col].unique()}")

Name :['Alice' 'Bob' 'Charlie' 'David' 'Eva' 'Frank' 'Grace' 'Hannah' 'Ivan'
 'Jack']
Age :[45. 58. 60. 28. 49. 67. nan 37. 31. 29.]
City :['New York' 'London' 'Tokyo' 'Paris' 'Berlin']
Salary :[95445. 86235. 62330. 46022. 65999. 88320. 57141. 65413. 87016. 58725.
    nan]
Date :['2023-01-01' '2023-01-02' '2023-01-03' '2023-01-04' '2023-01-05'
 '2023-01-06' '2023-01-07' '2023-01-08' '2023-01-09' '2023-01-10']
Category :['A' 'B' 'C' None]

In [456]:
#sum of unique values
df.nunique()

Name        10
Age          9
City         5
Salary      10
Date        10
Category     3
dtype: int64

In [457]:
# give it in ascending order
df.Age.nsmallest()

3     28.0
12    29.0
9     31.0
11    31.0
8     37.0
Name: Age, dtype: float64

In [458]:
#give it in descending order
df.Age.nlargest()

5     67.0
2     60.0
7     60.0
13    60.0
1     58.0
Name: Age, dtype: float64

In [459]:
# statistical description of the numerical data
df.describe()

             Age        Salary
count  13.000000     13.000000
mean   45.538462  70425.230769
std    14.157539  16018.646562
min    28.000000  46022.000000
25%    31.000000  58725.000000
50%    45.000000  65413.000000
75%    60.000000  87016.000000
max    67.000000  95445.000000

In [460]:
df.describe(include='object').T

         count unique         top freq
Name        14     10        Ivan    2
City        14      5    New York    3
Date        14     10  2023-01-09    2
Category    13      3           B    6

## **Indexing,Aceesing and Slicing**

In [461]:
col=df.columns[:4]
df[col]

       Name   Age      City   Salary
0     Alice  45.0  New York  95445.0
1       Bob  58.0    London  86235.0
2   Charlie  60.0     Tokyo  62330.0
3     David  28.0     Paris  46022.0
4       Eva  49.0    Berlin  65999.0
5     Frank  67.0     Paris  88320.0
6     Grace   NaN    Berlin  57141.0
7    Hannah  60.0  New York  65413.0
8      Ivan  37.0     Tokyo  87016.0
9      Jack  31.0    London  58725.0
10     Ivan  37.0     Tokyo  87016.0
11     Jack  31.0    London  58725.0
12    Grace  29.0    Berlin  57141.0
13   Hannah  60.0  New York      NaN

**Slicing**

In [462]:
df[1:10]

      Name   Age      City   Salary        Date Category
1      Bob  58.0    London  86235.0  2023-01-02        B
2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3    David  28.0     Paris  46022.0  2023-01-04        A
4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5    Frank  67.0     Paris  88320.0  2023-01-06        A
6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7   Hannah  60.0  New York  65413.0  2023-01-08        B
8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9     Jack  31.0    London  58725.0  2023-01-10        B

In [463]:
df[1:10:2] #step of 2

     Name   Age      City   Salary        Date Category
1     Bob  58.0    London  86235.0  2023-01-02        B
3   David  28.0     Paris  46022.0  2023-01-04        A
5   Frank  67.0     Paris  88320.0  2023-01-06        A
7  Hannah  60.0  New York  65413.0  2023-01-08        B
9    Jack  31.0    London  58725.0  2023-01-10        B

*loc categorical accesing*
- there is no excluding

In [464]:

df.loc[1] # accessing row with index 1

Name               Bob
Age               58.0
City            London
Salary         86235.0
Date        2023-01-02
Category             B
Name: 1, dtype: object

In [465]:
df.loc[1:5] #accessing rows with index 1 to 5

      Name   Age    City   Salary        Date Category
1      Bob  58.0  London  86235.0  2023-01-02        B
2  Charlie  60.0   Tokyo  62330.0  2023-01-03        C
3    David  28.0   Paris  46022.0  2023-01-04        A
4      Eva  49.0  Berlin  65999.0  2023-01-05        B
5    Frank  67.0   Paris  88320.0  2023-01-06        A

In [466]:
df.loc[:10,"Name":"Salary"] #accessing rows with index 0 to 10 and columns from Name to Salary

       Name   Age      City   Salary
0     Alice  45.0  New York  95445.0
1       Bob  58.0    London  86235.0
2   Charlie  60.0     Tokyo  62330.0
3     David  28.0     Paris  46022.0
4       Eva  49.0    Berlin  65999.0
5     Frank  67.0     Paris  88320.0
6     Grace   NaN    Berlin  57141.0
7    Hannah  60.0  New York  65413.0
8      Ivan  37.0     Tokyo  87016.0
9      Jack  31.0    London  58725.0
10     Ivan  37.0     Tokyo  87016.0

**Numerical accessing*
- there will be exclude

In [467]:
df.iloc[::] #accessing all rows and columns

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3     David  28.0     Paris  46022.0  2023-01-04        A
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
6     Grace   NaN    Berlin  57141.0  2023-01-07        C
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
12    Grace  29.0    Berlin  57141.0  2023-01-07     None
13   Hannah  60.0  New York      NaN  2023-01-08        B

In [468]:
df.iloc[:12] #accessing forst 12 rows

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3     David  28.0     Paris  46022.0  2023-01-04        A
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
6     Grace   NaN    Berlin  57141.0  2023-01-07        C
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B

In [469]:
df.iloc[:12,0:5] #accesing first 12 rows and first 5 columns

       Name   Age      City   Salary        Date
0     Alice  45.0  New York  95445.0  2023-01-01
1       Bob  58.0    London  86235.0  2023-01-02
2   Charlie  60.0     Tokyo  62330.0  2023-01-03
3     David  28.0     Paris  46022.0  2023-01-04
4       Eva  49.0    Berlin  65999.0  2023-01-05
5     Frank  67.0     Paris  88320.0  2023-01-06
6     Grace   NaN    Berlin  57141.0  2023-01-07
7    Hannah  60.0  New York  65413.0  2023-01-08
8      Ivan  37.0     Tokyo  87016.0  2023-01-09
9      Jack  31.0    London  58725.0  2023-01-10
10     Ivan  37.0     Tokyo  87016.0  2023-01-09
11     Jack  31.0    London  58725.0  2023-01-10

In [470]:
df.iloc[:12,0:5:2] #accesing first 12 rows and first 5 columns with step of 2

       Name      City        Date
0     Alice  New York  2023-01-01
1       Bob    London  2023-01-02
2   Charlie     Tokyo  2023-01-03
3     David     Paris  2023-01-04
4       Eva    Berlin  2023-01-05
5     Frank     Paris  2023-01-06
6     Grace    Berlin  2023-01-07
7    Hannah  New York  2023-01-08
8      Ivan     Tokyo  2023-01-09
9      Jack    London  2023-01-10
10     Ivan     Tokyo  2023-01-09
11     Jack    London  2023-01-10

## **Boolean indexing**

In [471]:
df['Age']>30

0      True
1      True
2      True
3     False
4      True
5      True
6     False
7      True
8      True
9      True
10     True
11     True
12    False
13     True
Name: Age, dtype: bool

In [472]:
df[df['Age']>30] #accessing rows where age is greater than 30

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
13   Hannah  60.0  New York      NaN  2023-01-08        B

In [473]:
df[df['Category']=='C'] #accessing rows where category is C

      Name   Age    City   Salary        Date Category
2  Charlie  60.0   Tokyo  62330.0  2023-01-03        C
6    Grace   NaN  Berlin  57141.0  2023-01-07        C

In [474]:
df[(df['Age']>30)& (df['Category']=='A')] #accessing rows where age is greater than 30 and category is A

     Name   Age      City   Salary        Date Category
0   Alice  45.0  New York  95445.0  2023-01-01        A
5   Frank  67.0     Paris  88320.0  2023-01-06        A
8    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
10   Ivan  37.0     Tokyo  87016.0  2023-01-09        A

In [475]:
df[(df['Age']>30)& (df['City']=='Tokyo')] #accessing rows where age is greater than 30 and city is Tokyo

       Name   Age   City   Salary        Date Category
2   Charlie  60.0  Tokyo  62330.0  2023-01-03        C
8      Ivan  37.0  Tokyo  87016.0  2023-01-09        A
10     Ivan  37.0  Tokyo  87016.0  2023-01-09        A

In [476]:
df[df['Category'].isin([ 'A', 'B'])]

      Name   Age      City   Salary        Date Category
0    Alice  45.0  New York  95445.0  2023-01-01        A
1      Bob  58.0    London  86235.0  2023-01-02        B
3    David  28.0     Paris  46022.0  2023-01-04        A
4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5    Frank  67.0     Paris  88320.0  2023-01-06        A
7   Hannah  60.0  New York  65413.0  2023-01-08        B
8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9     Jack  31.0    London  58725.0  2023-01-10        B
10    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11    Jack  31.0    London  58725.0  2023-01-10        B
13  Hannah  60.0  New York      NaN  2023-01-08        B

In [477]:
df[df['City'].isin(['New York','London'])] #accessing rows where city is NewYork or London

      Name   Age      City   Salary        Date Category
0    Alice  45.0  New York  95445.0  2023-01-01        A
1      Bob  58.0    London  86235.0  2023-01-02        B
7   Hannah  60.0  New York  65413.0  2023-01-08        B
9     Jack  31.0    London  58725.0  2023-01-10        B
11    Jack  31.0    London  58725.0  2023-01-10        B
13  Hannah  60.0  New York      NaN  2023-01-08        B

**Query**

In [478]:
df.query('Age>30') #accessing rows where age is greater than 30

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
13   Hannah  60.0  New York      NaN  2023-01-08        B

In [479]:
df.query('Category =="C"') #accessing rows where category is C

      Name   Age    City   Salary        Date Category
2  Charlie  60.0   Tokyo  62330.0  2023-01-03        C
6    Grace   NaN  Berlin  57141.0  2023-01-07        C

In [480]:
df.query('Age > 30 & Category == "A"') #using query to access rows where age is greater than 30 and category is A

     Name   Age      City   Salary        Date Category
0   Alice  45.0  New York  95445.0  2023-01-01        A
5   Frank  67.0     Paris  88320.0  2023-01-06        A
8    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
10   Ivan  37.0     Tokyo  87016.0  2023-01-09        A

**Where**

In [481]:
import numpy as np

In [482]:
np.where(df['Age']>30) #Based on index validate

(array([ 0,  1,  2,  4,  5,  7,  8,  9, 10, 11, 13]),)

**Accessing value and Modify**

In [483]:
df['Name'][2]

'Charlie'

In [484]:
print(f"Before Modifieng :{df['Name'][2]}")
df['Name'][2]='laxmi'
print(f"After Modifieng :{df['Name'][2]}")

Before Modifieng :Charlie
After Modifieng :laxmi

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\3283917158.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Name'][2]='laxmi'
C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\3283917158.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]='laxmi'

In [485]:
df.loc[2] # accessing row with index 2

Name             laxmi
Age               60.0
City             Tokyo
Salary         62330.0
Date        2023-01-03
Category             C
Name: 2, dtype: object

## String Methods

In [486]:
df[df['City'].str.contains('London',case=False)] #accessing rows where city contains London #case accept both upper and lowe case

    Name   Age    City   Salary        Date Category
1    Bob  58.0  London  86235.0  2023-01-02        B
9   Jack  31.0  London  58725.0  2023-01-10        B
11  Jack  31.0  London  58725.0  2023-01-10        B

In [487]:
df['City'].str.split(' ') #splitting city column by space

0     [New, York]
1        [London]
2         [Tokyo]
3         [Paris]
4        [Berlin]
5         [Paris]
6        [Berlin]
7     [New, York]
8         [Tokyo]
9        [London]
10        [Tokyo]
11       [London]
12       [Berlin]
13    [New, York]
Name: City, dtype: object

In [488]:
df['City'].str.split(' ').str.get(0) #getting first element after splitting city column by space

0        New
1     London
2      Tokyo
3      Paris
4     Berlin
5      Paris
6     Berlin
7        New
8      Tokyo
9     London
10     Tokyo
11    London
12    Berlin
13       New
Name: City, dtype: object

In [489]:
df['City'].str.replace('London','India')  #replacing London with India in city column

0     New York
1        India
2        Tokyo
3        Paris
4       Berlin
5        Paris
6       Berlin
7     New York
8        Tokyo
9        India
10       Tokyo
11       India
12      Berlin
13    New York
Name: City, dtype: object

In [490]:
df['City']=df['City'].str.replace('London','India')  # replacing London with India in city column
df

      Name   Age      City   Salary        Date Category
0    Alice  45.0  New York  95445.0  2023-01-01        A
1      Bob  58.0     India  86235.0  2023-01-02        B
2    laxmi  60.0     Tokyo  62330.0  2023-01-03        C
3    David  28.0     Paris  46022.0  2023-01-04        A
4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5    Frank  67.0     Paris  88320.0  2023-01-06        A
6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7   Hannah  60.0  New York  65413.0  2023-01-08        B
8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9     Jack  31.0     India  58725.0  2023-01-10        B
10    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11    Jack  31.0     India  58725.0  2023-01-10        B
12   Grace  29.0    Berlin  57141.0  2023-01-07     None
13  Hannah  60.0  New York      NaN  2023-01-08        B

In [491]:
df[df['Name'].str.startswith('A')] #accessing rows where name starts with A

    Name   Age      City   Salary        Date Category
0  Alice  45.0  New York  95445.0  2023-01-01        A

In [492]:
df[df['Name'].str.endswith('i')] # accessing rows where name ends with i

    Name   Age   City   Salary        Date Category
2  laxmi  60.0  Tokyo  62330.0  2023-01-03        C

## **Data Manipulation**

In [493]:
df['Name1']=df['Name'].str.upper() # uppercase all names

In [494]:
df['Name1']=df['Name'].str.lower() # lowercase all names

In [495]:
df['Name1']=df['Name'].str.capitalize() # capitalizing first letter of each name

In [496]:
df['Name'].str.count('Hannah').sum() #counting the number of times Hannah appears in Name column

np.int64(2)

In [497]:
df['Name'].add(' Mr') #adding Mr to each name in Name column

0      Alice Mr
1        Bob Mr
2      laxmi Mr
3      David Mr
4        Eva Mr
5      Frank Mr
6      Grace Mr
7     Hannah Mr
8       Ivan Mr
9       Jack Mr
10      Ivan Mr
11      Jack Mr
12     Grace Mr
13    Hannah Mr
Name: Name, dtype: object

In [498]:
df.rename(columns={'Name':'Full Name'},inplace =True) # renaming Name column to Full Name
df

   Full Name   Age      City   Salary        Date Category   Name1
0      Alice  45.0  New York  95445.0  2023-01-01        A   Alice
1        Bob  58.0     India  86235.0  2023-01-02        B     Bob
2      laxmi  60.0     Tokyo  62330.0  2023-01-03        C   Laxmi
3      David  28.0     Paris  46022.0  2023-01-04        A   David
4        Eva  49.0    Berlin  65999.0  2023-01-05        B     Eva
5      Frank  67.0     Paris  88320.0  2023-01-06        A   Frank
6      Grace   NaN    Berlin  57141.0  2023-01-07        C   Grace
7     Hannah  60.0  New York  65413.0  2023-01-08        B  Hannah
8       Ivan  37.0     Tokyo  87016.0  2023-01-09        A    Ivan
9       Jack  31.0     India  58725.0  2023-01-10        B    Jack
10      Ivan  37.0     Tokyo  87016.0  2023-01-09        A    Ivan
11      Jack  31.0     India  58725.0  2023-01-10        B    Jack
12     Grace  29.0    Berlin  57141.0  2023-01-07     None   Grace
13    Hannah  60.0  New York      NaN  2023-01-08        B  Hannah

**Data Cleaning**

Errors

- Missing values =no values or empty causes due to data entry issue, during transformation from one device to another due to loading
- Duplicates = row has been repeated multiple times causes due to misconception
- Outlier = 

- Null value find out by isnull, isna, notna, notnull
- Handling missing values

- Accepting, dropping,imputation
in drop there are 2 types list and point wise 

- imputation replace null values with determined value, determined means there are numerical(mean) and categorical(mode) replace using fillna
- duplicates  handled by droping duplicates
- outliers handled by z-score (formula) it must be b/w -3 to +3 otherwise it is an outlier
and IQR =Q3 - Q1 if any of them exceeding lower and upper fence then it is an outlier
- handling outlier through retain,remove and transformation(logroot,square root, cube root transformation)

In [499]:
data =pd.DataFrame({'A':[1,2,None, 4,None,6,7,1,100],'B':[7,None,9,None,11,None,50,7,7]})
data # creating a dataframe with missing values

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
7    1.0   7.0
8  100.0   7.0

In [500]:
data.isnull() # checking for null values in the dataframe

       A      B
0  False  False
1  False   True
2   True  False
3  False   True
4   True  False
5  False   True
6  False  False
7  False  False
8  False  False

In [501]:
data.isnull().sum() # counting the number of null values in each column

A    2
B    3
dtype: int64

In [502]:
data.duplicated() # counting the number of duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [503]:
data.duplicated().sum() # counting the number of duplicate rows

np.int64(1)

*handling outliers*

In [504]:
#finding Outliers using IQR method
def find_outliers(df, columns):
    outlier_indices = set()
    for col in columns:
        Q1 = df[col].quantile(0.25)
        Q3 = df[col].quantile(0.75)
        IQR = Q3 - Q1
        Lower_bound = Q1 - 1.5 * IQR
        Upper_bound = Q3 + 1.5 * IQR
        # Find indices of outliers for this column
        indices = df[(df[col] < Lower_bound) | (df[col] > Upper_bound)].index
        outlier_indices.update(indices)
    return df.loc[list(outlier_indices)]

In [505]:
outliers=find_outliers(data,['A','B'])
print(outliers)

       A     B
8  100.0   7.0
6    7.0  50.0

In [506]:
find_outliers(data,['A','B']) # finding outliers in columns A and B

       A     B
8  100.0   7.0
6    7.0  50.0

In [507]:
data['A'].fillna(round(data['B'].mean(),2)) # filling missing values in column A with mean of column B rounded to 2 decimal places

0      1.00
1      2.00
2     15.17
3      4.00
4     15.17
5      6.00
6      7.00
7      1.00
8    100.00
Name: A, dtype: float64

In [508]:
data['A']

0      1.0
1      2.0
2      NaN
3      4.0
4      NaN
5      6.0
6      7.0
7      1.0
8    100.0
Name: A, dtype: float64

In [509]:
data['A'].interpolate() #replace missing value with average of the surrounding values

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      1.0
8    100.0
Name: A, dtype: float64

In [510]:
data.drop_duplicates() # removing duplicate rows

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
8  100.0   7.0

In [511]:
data[data.duplicated()] # accessing rows that are duplicates

     A    B
7  1.0  7.0

In [512]:
data.drop_duplicates() # removing duplicate rows

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
8  100.0   7.0

In [513]:
data.drop_duplicates().reset_index(drop=True) #removing duplicate rows and resetting the index

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
7  100.0   7.0

## **Handle the outlier**

In [514]:

def remove_outliers(df, columns):  
    
    Cleaned_df =df.copy()

    for col in columns:
        Q1 =  Cleaned_df[col].quantile(0.25)
        Q3 =  Cleaned_df[col].quantile(0.75)
        IQR = Q3 - Q1
        lf= Q1 - 1.5 * IQR
        uf = Q3 + 1.5 * IQR
       
       
        Cleaned_df =  Cleaned_df[( Cleaned_df[col] >=lf) & ( Cleaned_df[col] <=uf)]
        
    return Cleaned_df

outliers = find_outliers(data,['A','B'])
print(outliers)

       A     B
8  100.0   7.0
6    7.0  50.0

In [515]:
def log_transformation(df,columns):
    transform_df = df.copy()

    for col in columns:
        transform_df[col] = np.log1p(transform_df[col]) #log1p= log(1+x) transformation
        return transform_df
log = log_transformation(data,['A','B'])
log

          A     B
0  0.693147   7.0
1  1.098612   NaN
2       NaN   9.0
3  1.609438   NaN
4       NaN  11.0
5  1.945910   NaN
6  2.079442  50.0
7  0.693147   7.0
8  4.615121   7.0

In [516]:
df

   Full Name   Age      City   Salary        Date Category   Name1
0      Alice  45.0  New York  95445.0  2023-01-01        A   Alice
1        Bob  58.0     India  86235.0  2023-01-02        B     Bob
2      laxmi  60.0     Tokyo  62330.0  2023-01-03        C   Laxmi
3      David  28.0     Paris  46022.0  2023-01-04        A   David
4        Eva  49.0    Berlin  65999.0  2023-01-05        B     Eva
5      Frank  67.0     Paris  88320.0  2023-01-06        A   Frank
6      Grace   NaN    Berlin  57141.0  2023-01-07        C   Grace
7     Hannah  60.0  New York  65413.0  2023-01-08        B  Hannah
8       Ivan  37.0     Tokyo  87016.0  2023-01-09        A    Ivan
9       Jack  31.0     India  58725.0  2023-01-10        B    Jack
10      Ivan  37.0     Tokyo  87016.0  2023-01-09        A    Ivan
11      Jack  31.0     India  58725.0  2023-01-10        B    Jack
12     Grace  29.0    Berlin  57141.0  2023-01-07     None   Grace
13    Hannah  60.0  New York      NaN  2023-01-08        B  Hannah

In [517]:
df.isnull().sum() # checking for null values in the dataframe

Full Name    0
Age          1
City         0
Salary       1
Date         0
Category     1
Name1        0
dtype: int64

In [518]:
df.duplicated().sum() # counting the number of duplicate rows

np.int64(2)

In [519]:
df['Age'].fillna(round(df['Age'].mean(),2),inplace=True) # filling missing values in Age column with mean of Age column rounded to 2 decimal places
df['Salary'].fillna(round(df['Salary'].mean(),2),inplace=True)  # filling missing values in Salary column with mean of Salary column rounded to 2 decimal places
df['Category'].fillna(df['Category'].mode()[0],inplace=True) # filling missing values in Category column with mode of Category column
df

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\3560714758.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(round(df['Age'].mean(),2),inplace=True) # filling missing values in Age column with mean of Age column rounded to 2 decimal places
C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\3560714758.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(round(df['Salary'].mean(),2),inplace=True)  # filling missing values in Salary column with mean of Salary column rounded to 2 decimal places
C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\3560714758.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Category'].fillna(df['Category'].mode()[0],inplace=True) # filling missing values in Category column with mode of Category column

   Full Name    Age      City    Salary        Date Category   Name1
0      Alice  45.00  New York  95445.00  2023-01-01        A   Alice
1        Bob  58.00     India  86235.00  2023-01-02        B     Bob
2      laxmi  60.00     Tokyo  62330.00  2023-01-03        C   Laxmi
3      David  28.00     Paris  46022.00  2023-01-04        A   David
4        Eva  49.00    Berlin  65999.00  2023-01-05        B     Eva
5      Frank  67.00     Paris  88320.00  2023-01-06        A   Frank
6      Grace  45.54    Berlin  57141.00  2023-01-07        C   Grace
7     Hannah  60.00  New York  65413.00  2023-01-08        B  Hannah
8       Ivan  37.00     Tokyo  87016.00  2023-01-09        A    Ivan
9       Jack  31.00     India  58725.00  2023-01-10        B    Jack
10      Ivan  37.00     Tokyo  87016.00  2023-01-09        A    Ivan
11      Jack  31.00     India  58725.00  2023-01-10        B    Jack
12     Grace  29.00    Berlin  57141.00  2023-01-07        B   Grace
13    Hannah  60.00  New York  70425.23  2023-01-08        B  Hannah

## **Data Transformation**

In [520]:
df.rename(columns={'Name':'Full Name'}, inplace=True) # renaming Name column to Full Name

In [521]:
df['Age']= df['Age'].astype('int') # converting Age column to integer type

In [522]:
df['City'].replace({'New York':'London'},inplace=True) # replacing New York with London in City column

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\1293030024.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].replace({'New York':'London'},inplace=True) # replacing New York with London in City column

In [523]:
def Catgorize(col): # funvtion to categorize age
    if col <18:
        return "Young"
    elif col < 35:
        return "Adult" 
    elif col < 55:
        return "Middle Aged" 
    else:
        return "Senior"

In [524]:
df['Age Category'] = df['Age'].apply(Catgorize) # applying the function to Age column to create a new column Age Category

In [525]:
data1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]}) # creating a new dataframe
data1

   A  B
0  1  4
1  2  5
2  3  6

In [526]:
data1.applymap(lambda x:x**2)  # applymap used for element wise function on dataframe

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\343738465.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  data1.applymap(lambda x:x**2)  # applymap used for element wise function on dataframe

   A   B
0  1  16
1  4  25
2  9  36

In [527]:
df.loc[10] = {"Full Name": "Deepak","Age": 30, "City": "Bengaluru","Salary":60000,"Date": "2025-07-30","Category":"A","Name":"Deepak","Age Category":"Adult"} # adding a new row to the dataframe

In [528]:
df.loc[14] = {"Full Name": "Rohan","Age": 25, "City": "Bengaluru","Salary":60000,"Date": "2025-07-30","Category":"A","Name":"Deepak","Age Category":"Adult"} # adding another new row to the dataframe

In [529]:
df.drop_duplicates().reset_index(drop=True) # removing duplicate rows and resetting the index

,Full Name,Age,City,Salary,Date,Category,Name1,Age Category
0,Alice,45,London,95445.00,2023-01-01,A,Alice,Middle Aged
1,Bob,58,India,86235.00,2023-01-02,B,Bob,Senior
2,laxmi,60,Tokyo,62330.00,2023-01-03,C,Laxmi,Senior
3,David,28,Paris,46022.00,2023-01-04,A,David,Adult
4,Eva,49,Berlin,65999.00,2023-01-05,B,Eva,Middle Aged
5,Frank,67,Paris,88320.00,2023-01-06,A,Frank,Senior
6,Grace,45,Berlin,57141.00,2023-01-07,C,Grace,Middle Aged
7,Hannah,60,London,65413.00,2023-01-08,B,Hannah,Senior
8,Ivan,37,Tokyo,87016.00,2023-01-09,A,Ivan,Middle Aged
9,Jack,31,India,58725.00,2023-01-10,B,Jack,Adult
10,Deepak,30,Bengaluru,60000.00,2025-07-30,A,NaN,Adult
11,Grace,29,Berlin,57141.00,2023-01-07,B,Grace,Adult
12,Hannah,60,London,70425.23,2023-01-08,B,Hannah,Senior
13,Rohan,25,Bengaluru,60000.00,2025-07-30,A,NaN,Adult

In [530]:
sum_of_Salary = df['Salary'].sum() # calculating the sum of Salary column
sum_of_Salary

np.float64(1018937.23)

In [531]:
min_of_Salary = df['Salary'].min() # finding the minimum salary
min_of_Salary

np.float64(46022.0)

In [532]:
max_of_Salary = df['Salary'].max() # finding the maximum salary
max_of_Salary

np.float64(95445.0)

In [533]:
avg_of_age = df['Age'].mean() # calculating the average of Age column
avg_of_age

np.float64(43.666666666666664)

In [534]:
avg_of_age = round(df['Age'].mean()) # rounding the average of Age column
avg_of_age

44

In [535]:
avg_of_age = round(df['Age'].median()) # median of Age column
avg_of_age

45

In [536]:
most_occured_category = df['Category'].mode() # finding the most occured category
most_occured_category

0    B
Name: Category, dtype: object

In [537]:
Std_Age = df['Age'].std() # standard deviation of Age column
Std_Age

np.float64(14.499589485157681)

In [538]:
var_Age = df['Age'].var() # variance of Age column
var_Age

np.float64(210.2380952380952)

In [539]:
np.sqrt(var_Age)== Std_Age # True

np.True_

In [540]:
df['Category'] == 'B' # counting the number of rows where Category is B

0     False
1      True
2     False
3     False
4      True
5     False
6     False
7      True
8     False
9      True
10    False
11     True
12     True
13     True
14    False
Name: Category, dtype: bool

In [541]:
df[df['Category'] == 'B'].count() # counting the number of rows where Category is B

Full Name       7
Age             7
City            7
Salary          7
Date            7
Category        7
Name1           7
Age Category    7
dtype: int64

In [542]:
df['Category'][df['Category'] == 'B'].count() # counting the number of rows where Category is B

np.int64(7)

In [543]:
df['Age'].idxmax() # largest age index

np.int64(5)

In [544]:
df['Age'].idxmin() # smallest age index

np.int64(14)

In [545]:
df['Age'].skew() # skewness of Age column

np.float64(0.22869995105155044)

In [546]:
df['Age'].rank(method='average') # ranking the Age column, method can be 'average', 'min', max', first', 'dense','ordinal'.

0      8.5
1     11.0
2     13.0
3      2.0
4     10.0
5     15.0
6      8.5
7     13.0
8      7.0
9      5.5
10     4.0
11     5.5
12     3.0
13    13.0
14     1.0
Name: Age, dtype: float64

In [547]:
df['Age'].sort_values(ascending=True) # sorting Age column in ascending order

14    25
3     28
12    29
10    30
9     31
11    31
8     37
0     45
6     45
4     49
1     58
2     60
13    60
7     60
5     67
Name: Age, dtype: int64

In [548]:
df['Age'].rank(ascending=True) # ranking the Age column in ascending order

0      8.5
1     11.0
2     13.0
3      2.0
4     10.0
5     15.0
6      8.5
7     13.0
8      7.0
9      5.5
10     4.0
11     5.5
12     3.0
13    13.0
14     1.0
Name: Age, dtype: float64

In [549]:
df[df['Age'].between(24,35)]

   Full Name  Age       City   Salary        Date Category  Name1 Age Category
3      David   28      Paris  46022.0  2023-01-04        A  David        Adult
9       Jack   31      India  58725.0  2023-01-10        B   Jack        Adult
10    Deepak   30  Bengaluru  60000.0  2025-07-30        A    NaN        Adult
11      Jack   31      India  58725.0  2023-01-10        B   Jack        Adult
12     Grace   29     Berlin  57141.0  2023-01-07        B  Grace        Adult
14     Rohan   25  Bengaluru  60000.0  2025-07-30        A    NaN        Adult

In [550]:
df['Category']=df['Category'].map({'A':'X', 'B':'Y','C':'Z'})

In [551]:
df['Age'].add(1)

0     46
1     59
2     61
3     29
4     50
5     68
6     46
7     61
8     38
9     32
10    31
11    32
12    30
13    61
14    26
Name: Age, dtype: int64

In [552]:
df['Age'].subtract(1)

0     44
1     57
2     59
3     27
4     48
5     66
6     44
7     59
8     36
9     30
10    29
11    30
12    28
13    59
14    24
Name: Age, dtype: int64

In [553]:
df['Age'].multiply(2)

0      90
1     116
2     120
3      56
4      98
5     134
6      90
7     120
8      74
9      62
10     60
11     62
12     58
13    120
14     50
Name: Age, dtype: int64

In [554]:
df['Age'].div(2)

0     22.5
1     29.0
2     30.0
3     14.0
4     24.5
5     33.5
6     22.5
7     30.0
8     18.5
9     15.5
10    15.0
11    15.5
12    14.5
13    30.0
14    12.5
Name: Age, dtype: float64

In [555]:
df['Age'].mod(2) # modulus of Age column

0     1
1     0
2     0
3     0
4     1
5     1
6     1
7     0
8     1
9     1
10    0
11    1
12    1
13    0
14    1
Name: Age, dtype: int64

In [556]:
df['Age'].mod(2)==0 # checking if Age is even

0     False
1      True
2      True
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10     True
11    False
12    False
13     True
14    False
Name: Age, dtype: bool

In [557]:
df[df['Age'].ge(35)] # finding rows where Age is greater than or equal to 35

   Full Name  Age    City    Salary        Date Category   Name1 Age Category
0      Alice   45  London  95445.00  2023-01-01        X   Alice  Middle Aged
1        Bob   58   India  86235.00  2023-01-02        Y     Bob       Senior
2      laxmi   60   Tokyo  62330.00  2023-01-03        Z   Laxmi       Senior
4        Eva   49  Berlin  65999.00  2023-01-05        Y     Eva  Middle Aged
5      Frank   67   Paris  88320.00  2023-01-06        X   Frank       Senior
6      Grace   45  Berlin  57141.00  2023-01-07        Z   Grace  Middle Aged
7     Hannah   60  London  65413.00  2023-01-08        Y  Hannah       Senior
8       Ivan   37   Tokyo  87016.00  2023-01-09        X    Ivan  Middle Aged
13    Hannah   60  London  70425.23  2023-01-08        Y  Hannah       Senior

In [558]:
df['Category'].value_counts() # counting the number of occurences of each category

Category
Y    7
X    6
Z    2
Name: count, dtype: int64

In [559]:
df['Category'].value_counts().values # getting the values of value counts

array([7, 6, 2])

In [560]:
df['Category'].value_counts().index # getting the index of value counts

Index(['Y', 'X', 'Z'], dtype='object', name='Category')

In [561]:
df.groupby('Category')['Salary'].sum() # finding total salary in each category

Category
X    436803.00
Y    462663.23
Z    119471.00
Name: Salary, dtype: float64

In [562]:
df.groupby('Category')['Salary'].mean() # finding average salary in each category

Category
X    72800.500000
Y    66094.747143
Z    59735.500000
Name: Salary, dtype: float64

In [563]:
df.groupby('Category')['Salary'].median() # finding median salary in each category

Category
X    73508.0
Y    65413.0
Z    59735.5
Name: Salary, dtype: float64

In [564]:
df.groupby('Category')['Salary'].first() # finding first salary in each category

Category
X    95445.0
Y    86235.0
Z    62330.0
Name: Salary, dtype: float64

In [565]:
df.groupby('Category')['Salary'].last() # finding last salary in each category

Category
X    60000.00
Y    70425.23
Z    57141.00
Name: Salary, dtype: float64

In [566]:
df.groupby('Category')['Salary'].min() # finding minimum salary in each category

Category
X    46022.0
Y    57141.0
Z    57141.0
Name: Salary, dtype: float64

In [567]:
df.groupby('Category')['Salary'].max() # finding maximum salary in each category

Category
X    95445.0
Y    86235.0
Z    62330.0
Name: Salary, dtype: float64

In [568]:
df[df['Category']=='X'] # accessing rows where Category is X

   Full Name  Age       City   Salary        Date Category  Name1 Age Category
0      Alice   45     London  95445.0  2023-01-01        X  Alice  Middle Aged
3      David   28      Paris  46022.0  2023-01-04        X  David        Adult
5      Frank   67      Paris  88320.0  2023-01-06        X  Frank       Senior
8       Ivan   37      Tokyo  87016.0  2023-01-09        X   Ivan  Middle Aged
10    Deepak   30  Bengaluru  60000.0  2025-07-30        X    NaN        Adult
14     Rohan   25  Bengaluru  60000.0  2025-07-30        X    NaN        Adult

In [569]:
df.groupby('City')['Salary'].max() # finding maximum salary in each city

City
Bengaluru    60000.0
Berlin       65999.0
India        86235.0
London       95445.0
Paris        88320.0
Tokyo        87016.0
Name: Salary, dtype: float64

In [570]:
df.groupby('City').agg({'Age':'mean'}) # grouping by City and aggregate Age column to find mean

            Age
City
Bengaluru  27.5
Berlin     41.0
India      40.0
London     55.0
Paris      47.5
Tokyo      48.5

In [571]:
df.groupby(['Category','Age Category']).agg({'Salary':'sum'}) # grouping by Category and Age Category and aggregate

                          Salary
Category Age Category
X        Adult         166022.00
         Middle Aged   182461.00
         Senior         88320.00
Y        Adult         174591.00
         Middle Aged    65999.00
         Senior        222073.23
Z        Middle Aged    57141.00
         Senior         62330.00

In [572]:
df.groupby(['Category','Age Category']).agg({'Salary':'sum'}).sort_values(by='Salary',ascending=False).reset_index() # grouping by Category and Age Category and aggregate

  Category Age Category     Salary
0        Y       Senior  222073.23
1        X  Middle Aged  182461.00
2        Y        Adult  174591.00
3        X        Adult  166022.00
4        X       Senior   88320.00
5        Y  Middle Aged   65999.00
6        Z       Senior   62330.00
7        Z  Middle Aged   57141.00

In [573]:
df.groupby(['Category','Age Category']).agg({'Salary':'sum','Age':'mean'}).reset_index() # grouping by Category and Age Category and aggregate

  Category Age Category     Salary        Age
0        X        Adult  166022.00  27.666667
1        X  Middle Aged  182461.00  41.000000
2        X       Senior   88320.00  67.000000
3        Y        Adult  174591.00  30.333333
4        Y  Middle Aged   65999.00  49.000000
5        Y       Senior  222073.23  59.333333
6        Z  Middle Aged   57141.00  45.000000
7        Z       Senior   62330.00  60.000000

In [574]:
category_salary_age=df.groupby(['Age Category']).agg({'Salary':['min','max'],'Age':['min','max']}).reset_index() # grouping by Age Category and aggregate 
category_salary_age

  Age Category   Salary          Age
                    min      max min max
0        Adult  46022.0  60000.0  25  31
1  Middle Aged  57141.0  95445.0  37  49
2       Senior  62330.0  88320.0  58  67

In [575]:
category_salary_age.unstack() # stacking the dataframe to convert columns into rows

Age Category       0          Adult
                   1    Middle Aged
                   2         Senior
Salary        min  0        46022.0
                   1        57141.0
                   2        62330.0
              max  0        60000.0
                   1        95445.0
                   2        88320.0
Age           min  0             25
                   1             37
                   2             58
              max  0             31
                   1             49
                   2             67
dtype: object

In [576]:
category_salary_age.stack() # stacking the dataframe to convert columns into rows

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\1282468956.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  category_salary_age.stack() # stacking the dataframe to convert columns into rows

      Age Category   Salary   Age
0            Adult      NaN   NaN
  max          NaN  60000.0  31.0
  min          NaN  46022.0  25.0
1      Middle Aged      NaN   NaN
  max          NaN  95445.0  49.0
  min          NaN  57141.0  37.0
2           Senior      NaN   NaN
  max          NaN  88320.0  67.0
  min          NaN  62330.0  58.0

### **Joining***

In [ ]:
left_data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 28, 24],
}

left_df = pd.DataFrame(left_data)

# Sample data for right DataFrame
right_data = {
    'ID': [1, 2, 4, 5, 6],
    'City': ['New York', 'London', 'Paris', 'Berlin', 'Tokyo'],
    'Salary': [60000, 75000, 62000, 57000, 80000],
}

right_df = pd.DataFrame(right_data)

In [578]:
data3= pd.merge(left_df, right_df,on='ID') # default inner join
data3

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [ ]:
inner_join= pd.merge(left_df,right_df,on='ID',how='inner') 
inner_join

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [580]:
outer_join= pd.merge(left_df,right_df,on='ID',how='outer')
outer_join

   ID     Name   Age      City   Salary
0   1    Alice  25.0  New York  60000.0
1   2      Bob  30.0    London  75000.0
2   3  Charlie  35.0       NaN      NaN
3   4    David  28.0     Paris  62000.0
4   5      Eva  24.0    Berlin  57000.0
5   6      NaN   NaN     Tokyo  80000.0

In [ ]:
left_join= pd.merge(left_df,right_df,on='ID',how='left') 
left_join

   ID     Name  Age      City   Salary
0   1    Alice   25  New York  60000.0
1   2      Bob   30    London  75000.0
2   3  Charlie   35       NaN      NaN
3   4    David   28     Paris  62000.0
4   5      Eva   24    Berlin  57000.0

In [ ]:
right_join= pd.merge(left_df,right_df,on='ID',how='right') 
right_join

   ID   Name   Age      City  Salary
0   1  Alice  25.0  New York   60000
1   2    Bob  30.0    London   75000
2   4  David  28.0     Paris   62000
3   5    Eva  24.0    Berlin   57000
4   6    NaN   NaN     Tokyo   80000

### *pivote table*

In [ ]:
df.pivot_table(index='City',columns='Age Category',values='Salary',aggfunc='sum') # creating a pivot table with city as index, age category as columns, and salary as values, using sum as aggregation function

Age Category     Adult  Middle Aged     Senior
City
Bengaluru     120000.0          NaN        NaN
Berlin         57141.0     123140.0        NaN
India         117450.0          NaN   86235.00
London             NaN      95445.0  135838.23
Paris          46022.0          NaN   88320.00
Tokyo              NaN      87016.0   62330.00

In [ ]:
df.pivot_table(index='Full Name',columns='Category',values='Age',aggfunc='mean') # creating a pivot table with Full Name as index, Category as columns, and Age as values, using mean as aggregation function

Category      X     Y     Z
Full Name
Alice      45.0   NaN   NaN
Bob         NaN  58.0   NaN
David      28.0   NaN   NaN
Deepak     30.0   NaN   NaN
Eva         NaN  49.0   NaN
Frank      67.0   NaN   NaN
Grace       NaN  29.0  45.0
Hannah      NaN  60.0   NaN
Ivan       37.0   NaN   NaN
Jack        NaN  31.0   NaN
Rohan      25.0   NaN   NaN
laxmi       NaN   NaN  60.0

In [ ]:
cross_tab= pd.crosstab(index=df['Full Name'],columns=df['Category'],values=df['Salary'],aggfunc='sum') # creating a cross tabulation of Full Name and Category with Salary as values 
cross_tab

Category         X          Y        Z
Full Name
Alice      95445.0        NaN      NaN
Bob            NaN   86235.00      NaN
David      46022.0        NaN      NaN
Deepak     60000.0        NaN      NaN
Eva            NaN   65999.00      NaN
Frank      88320.0        NaN      NaN
Grace          NaN   57141.00  57141.0
Hannah         NaN  135838.23      NaN
Ivan       87016.0        NaN      NaN
Jack           NaN  117450.00      NaN
Rohan      60000.0        NaN      NaN
laxmi          NaN        NaN  62330.0

### **Time Seies Analysis**

In [591]:
from datetime import datetime

In [592]:
today = datetime.now()
today

datetime.datetime(2025, 7, 31, 11, 41, 37, 287425)

In [593]:
today.year

2025

In [594]:
today.month

7

In [595]:
today.day

31

In [596]:
today.hour

11

In [599]:
date = (today,format=='%Y-%m-%d %H :%M:%S')
date

(datetime.datetime(2025, 7, 31, 11, 41, 37, 287425), False)

In [600]:
date = today.strftime('%y-%m-%d')
date

'25-07-31'

In [601]:
date = today.strftime('%A %d-%m-%y')
date

'Thursday 31-07-25'

In [602]:
date = today.strftime('%A %d-%B-%y')
date

'Thursday 31-July-25'

In [603]:
date = today.strftime('%A %d-%b-%y')
date

'Thursday 31-Jul-25'

In [ ]:
df.columns # checking the columns of the dataframe

Index(['Full Name', 'Age', 'City', 'Salary', 'Date', 'Category', 'Name1',
       'Age Category'],
      dtype='object')

In [ ]:
df.Date.dtype # checking the datatype of date column

dtype('O')

In [ ]:
pd.to_datetime(df['Date']).dt.year # getting the year from the Date column

0     2023
1     2023
2     2023
3     2023
4     2023
5     2023
6     2023
7     2023
8     2023
9     2023
10    2025
11    2023
12    2023
13    2023
14    2025
Name: Date, dtype: int32

In [ ]:
df['Date']=pd.to_datetime(df['Date'],format='%Y-%m-%d') #coverting Date column to datetime format
df['Date']=pd.DatetimeIndex(df['Date']) # converting Date column to DatetimeIndex
df['Date']

0    2023-01-01
1    2023-01-02
2    2023-01-03
3    2023-01-04
4    2023-01-05
5    2023-01-06
6    2023-01-07
7    2023-01-08
8    2023-01-09
9    2023-01-10
10   2025-07-30
11   2023-01-10
12   2023-01-07
13   2023-01-08
14   2025-07-30
Name: Date, dtype: datetime64[ns]

In [ ]:
df['Date'].dt.year # getting the year from the date column

0     2023
1     2023
2     2023
3     2023
4     2023
5     2023
6     2023
7     2023
8     2023
9     2023
10    2025
11    2023
12    2023
13    2023
14    2025
Name: Date, dtype: int32

In [ ]:
df['Date'].dt.day # getting the day from the date column

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    30
11    10
12     7
13     8
14    30
Name: Date, dtype: int32

In [ ]:
df['Date'].dt.month # getting the month from the Date column

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    7
11    1
12    1
13    1
14    7
Name: Date, dtype: int32

In [616]:
df['Year_Gap']= today.year - df['Date'].dt.year # calculating the year gap between today and the date in the Date column
df['Year_Gap']
df

,Full Name,Age,City,Salary,Date,Category,Name1,Age Category,Year_Gap
0,Alice,45,London,95445.00,2023-01-01,X,Alice,Middle Aged,2
1,Bob,58,India,86235.00,2023-01-02,Y,Bob,Senior,2
2,laxmi,60,Tokyo,62330.00,2023-01-03,Z,Laxmi,Senior,2
3,David,28,Paris,46022.00,2023-01-04,X,David,Adult,2
4,Eva,49,Berlin,65999.00,2023-01-05,Y,Eva,Middle Aged,2
5,Frank,67,Paris,88320.00,2023-01-06,X,Frank,Senior,2
6,Grace,45,Berlin,57141.00,2023-01-07,Z,Grace,Middle Aged,2
7,Hannah,60,London,65413.00,2023-01-08,Y,Hannah,Senior,2
8,Ivan,37,Tokyo,87016.00,2023-01-09,X,Ivan,Middle Aged,2
9,Jack,31,India,58725.00,2023-01-10,Y,Jack,Adult,2
10,Deepak,30,Bengaluru,60000.00,2025-07-30,X,NaN,Adult,0
11,Jack,31,India,58725.00,2023-01-10,Y,Jack,Adult,2
12,Grace,29,Berlin,57141.00,2023-01-07,Y,Grace,Adult,2
13,Hannah,60,London,70425.23,2023-01-08,Y,Hannah,Senior,2
14,Rohan,25,Bengaluru,60000.00,2025-07-30,X,NaN,Adult,0

In [ ]:
present_date = pd.date_range(start='31-07-2025',periods=13, freq='M') # monyhly frequency
present_date

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\1901332253.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  present_date = pd.date_range(start='31-07-2025',periods=13, freq='M')

DatetimeIndex(['2025-07-31', '2025-08-31', '2025-09-30', '2025-10-31',
               '2025-11-30', '2025-12-31', '2026-01-31', '2026-02-28',
               '2026-03-31', '2026-04-30', '2026-05-31', '2026-06-30',
               '2026-07-31'],
              dtype='datetime64[ns]', freq='ME')

In [ ]:
present_date = pd.date_range(start='31-07-2025',periods=13, freq='y') # yearly frequency
present_date

C:\Users\Pratiksha\AppData\Local\Temp\ipykernel_22780\4145461695.py:1: FutureWarning: 'y' is deprecated and will be removed in a future version, please use 'YE' instead.
  present_date = pd.date_range(start='31-07-2025',periods=13, freq='y')

DatetimeIndex(['2025-12-31', '2026-12-31', '2027-12-31', '2028-12-31',
               '2029-12-31', '2030-12-31', '2031-12-31', '2032-12-31',
               '2033-12-31', '2034-12-31', '2035-12-31', '2036-12-31',
               '2037-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

In [ ]:
present_date = pd.date_range(start='31-07-2025',periods=13, freq='d') # daily frequency
present_date

DatetimeIndex(['2025-07-31', '2025-08-01', '2025-08-02', '2025-08-03',
               '2025-08-04', '2025-08-05', '2025-08-06', '2025-08-07',
               '2025-08-08', '2025-08-09', '2025-08-10', '2025-08-11',
               '2025-08-12'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
import calendar  # printing the calender for the year 2026
print(calendar.month(2025,8))

    August 2025
Mo Tu We Th Fr Sa Su
             1  2  3
 4  5  6  7  8  9 10
11 12 13 14 15 16 17
18 19 20 21 22 23 24
25 26 27 28 29 30 31

In [ ]:
calendar.prcal(2026) # printing the calender for the year 2026

                                  2026

      January                   February                   March
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
          1  2  3  4                         1                         1
 5  6  7  8  9 10 11       2  3  4  5  6  7  8       2  3  4  5  6  7  8
12 13 14 15 16 17 18       9 10 11 12 13 14 15       9 10 11 12 13 14 15
19 20 21 22 23 24 25      16 17 18 19 20 21 22      16 17 18 19 20 21 22
26 27 28 29 30 31         23 24 25 26 27 28         23 24 25 26 27 28 29
                                                    30 31

       April                      May                       June
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
       1  2  3  4  5                   1  2  3       1  2  3  4  5  6  7
 6  7  8  9 10 11 12       4  5  6  7  8  9 10       8  9 10 11 12 13 14
13 14 15 16 17 18 19      11 12 13 14 15 16 17      15 16 17 18 19 20 21
20 21 22 23 24 25 26      18 19 20 21 22 23 24      22 23 24 25 26 27 28
27 28 29 30               25 26 27 28 29 30 31      29 30

        July                     August                  September
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
       1  2  3  4  5                      1  2          1  2  3  4  5  6
 6  7  8  9 10 11 12       3  4  5  6  7  8  9       7  8  9 10 11 12 13
13 14 15 16 17 18 19      10 11 12 13 14 15 16      14 15 16 17 18 19 20
20 21 22 23 24 25 26      17 18 19 20 21 22 23      21 22 23 24 25 26 27
27 28 29 30 31            24 25 26 27 28 29 30      28 29 30
                          31

      October                   November                  December
Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su      Mo Tu We Th Fr Sa Su
          1  2  3  4                         1          1  2  3  4  5  6
 5  6  7  8  9 10 11       2  3  4  5  6  7  8       7  8  9 10 11 12 13
12 13 14 15 16 17 18       9 10 11 12 13 14 15      14 15 16 17 18 19 20
19 20 21 22 23 24 25      16 17 18 19 20 21 22      21 22 23 24 25 26 27
26 27 28 29 30 31         23 24 25 26 27 28 29      28 29 30 31
                          30